# TooShortCurveDowngradeGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..TooShortCurveDowngradeGeometry Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Curve is too short and may downgrade the geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooShortCurveDowngradeGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooShortCurveDowngradeGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooShortCurveDowngradeGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace